In [156]:
import numpy as np
import pandas as pd

In [157]:
df = pd.read_csv("../Dataset/VberEats.csv")
df.dtypes

ids            int64
ages           int64
orders         int64
purchases    float64
bookmarks      int64
replies        int64
ratings        int64
period         int64
dtype: object

In [158]:
df

         ids  ages  orders  purchases  bookmarks  replies  ratings  period
0      47009    42      95  3509917.0          9       14       26      26
1      74838    41      10   673392.0         10       24       72      40
2      34976    20      23  1943940.0          6       20       51      19
3      34959    37      46  1981730.0          0       26       52      19
4      36710    36      93   386907.0         10       30       59      20
...      ...   ...     ...        ...        ...      ...      ...     ...
18946  33105    34      18  1335423.0         11       25       32      18
18947  38056    51      60   300000.0          9       32       33      21
18948  59148    51      75  4852735.0          0       32       81      32
18949  62573    34      63  2372982.0          6       33       71      34
18950  24173    21      82   300000.0          7       35       65      14

[18951 rows x 8 columns]

In [159]:
#분석을 수행하기 전, 아래의 전처리를 수행하시오.

In [160]:
test_set = df.loc[df['purchases'].isna()]
test_set.head()

       ids  ages  orders  purchases  bookmarks  replies  ratings  period
111  17967    20      10        NaN          5       29      113      10
323  68198    44       2        NaN          7       12       12      36
470   2336    30       1        NaN          9       26       96       2
550  55012    33      54        NaN          8       25       99      30
809  16217    25      51        NaN         11        9       12       9

In [161]:
train_set = df.loc[df['purchases'].isna()==False]
train_set.head()

     ids  ages  orders  purchases  bookmarks  replies  ratings  period
0  47009    42      95  3509917.0          9       14       26      26
1  74838    41      10   673392.0         10       24       72      40
2  34976    20      23  1943940.0          6       20       51      19
3  34959    37      46  1981730.0          0       26       52      19
4  36710    36      93   386907.0         10       30       59      20

In [162]:
test_set.shape

(203, 8)

In [163]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.preprocessing import MinMaxScaler
random_state=229

In [164]:
df.columns

Index(['ids', 'ages', 'orders', 'purchases', 'bookmarks', 'replies', 'ratings',
       'period'],
      dtype='object')

In [165]:
col = ['ages', 'orders', 'bookmarks', 'replies', 'ratings', 'period']
scaler = MinMaxScaler()
scaler = scaler.fit(train_set[col])

In [166]:
scaler.transform(train_set[col])

array([[0.66666667, 0.95918367, 0.75      , 0.35897436, 0.12440191,
        0.64102564],
       [0.63888889, 0.09183673, 0.83333333, 0.61538462, 0.34449761,
        1.        ],
       [0.05555556, 0.2244898 , 0.5       , 0.51282051, 0.24401914,
        0.46153846],
       ...,
       [0.91666667, 0.75510204, 0.        , 0.82051282, 0.38755981,
        0.79487179],
       [0.44444444, 0.63265306, 0.5       , 0.84615385, 0.33971292,
        0.84615385],
       [0.08333333, 0.82653061, 0.58333333, 0.8974359 , 0.31100478,
        0.33333333]])

In [167]:
train_scaled = train_set.copy()
train_scaled[col] = scaler.transform(train_set[col])
train_scaled.head()

,ids,ages,orders,purchases,bookmarks,replies,ratings,period
0,47009,0.666667,0.959184,3509917.0,0.750000,0.358974,0.124402,0.641026
1,74838,0.638889,0.091837,673392.0,0.833333,0.615385,0.344498,1.000000
2,34976,0.055556,0.224490,1943940.0,0.500000,0.512821,0.244019,0.461538
3,34959,0.527778,0.459184,1981730.0,0.000000,0.666667,0.248804,0.461538
4,36710,0.500000,0.938776,386907.0,0.833333,0.769231,0.282297,0.487179

In [168]:
test_scaled = test_set.copy()
test_scaled[col] = scaler.transform(test_set[col])
test_scaled.head()

,ids,ages,orders,purchases,bookmarks,replies,ratings,period
111,17967,0.055556,0.091837,NaN,0.416667,0.743590,0.540670,0.230769
323,68198,0.722222,0.010204,NaN,0.583333,0.307692,0.057416,0.897436
470,2336,0.333333,0.000000,NaN,0.750000,0.666667,0.459330,0.025641
550,55012,0.416667,0.540816,NaN,0.666667,0.641026,0.473684,0.743590
809,16217,0.194444,0.510204,NaN,0.916667,0.230769,0.057416,0.205128

In [169]:
X_col = ['ages', 'orders', 'bookmarks', 'replies', 'ratings', 'period']

In [170]:
model = DecisionTreeRegressor(random_state=random_state)
model.fit(train_scaled[X_col], train_scaled['purchases'])

DecisionTreeRegressor(criterion='mse', max_depth=None, max_features=None,
                      max_leaf_nodes=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      presort=False, random_state=229, splitter='best')

In [171]:
pred = model.predict(test_scaled[X_col])
pred.mean()

2029804.0738916255

In [172]:
pred.sum()

412050227.0

In [173]:
train_scaled['purchases'].sum()

50116080800.0

In [174]:
s =pred.sum()+train_scaled['purchases'].sum()

In [175]:
s/18951

2666251.4393435703

In [176]:
test_set['purchases'] = pred
test_set

C:\Users\syoun\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

         ids  ages  orders  purchases  bookmarks  replies  ratings  period
111    17967    20      10   585454.0          5       29      113      10
323    68198    44       2   340177.0          7       12       12      36
470     2336    30       1    58860.0          9       26       96       2
550    55012    33      54   335503.0          8       25       99      30
809    16217    25      51  4179609.0         11        9       12       9
...      ...   ...     ...        ...        ...      ...      ...     ...
18655  70234    50       2   180262.0          9       37       61      11
18817  42185    20       1    39086.0          2       30       94      23
18858  60779    19      55   527865.0          1        2        4      33
18872  50619    21      10   520444.0          1       28      105      27
18904  17662    26      76  4575187.0          8       25       45      10

[203 rows x 8 columns]

In [177]:
customer = train_set.append(test_set)
############이렇게 붙이면 원본 데이터가 손상된다!!!!

In [212]:
customer = df.copy()
customer.loc[customer['purchases'].isna(), 'purchases'] = pred

In [66]:
df

         ids  ages  orders  purchases  bookmarks  replies  ratings  period
0      47009    42      95  3509917.0          9       14       26      26
1      74838    41      10   673392.0         10       24       72      40
2      34976    20      23  1943940.0          6       20       51      19
3      34959    37      46  1981730.0          0       26       52      19
4      36710    36      93   386907.0         10       30       59      20
...      ...   ...     ...        ...        ...      ...      ...     ...
18946  33105    34      18  1335423.0         11       25       32      18
18947  38056    51      60   300000.0          9       32       33      21
18948  59148    51      75  4852735.0          0       32       81      32
18949  62573    34      63  2372982.0          6       33       71      34
18950  24173    21      82   300000.0          7       35       65      14

[18951 rows x 8 columns]

In [213]:
customer['purchases'].mean()

2666251.4393435703

In [68]:
#Q1

In [214]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
random_state=229

In [215]:
df_sub1 = customer.copy()
df_sub1 = df_sub1.sample(frac=0.25, random_state=229)
df_sub1

         ids  ages  orders   purchases  bookmarks  replies  ratings  period
6424    6941    33      57    204381.0          5        8       21       4
14181  43255    40       5     34325.0          6       25       75      24
8550   37222    31      88   6708403.0          3       18       67      20
3876   13537    43      32   1975157.0          0       11       15       8
12120  69188    34      64  11142283.0          9       11       32      38
...      ...   ...     ...         ...        ...      ...      ...     ...
16497  54196    41      41   1965026.0          0        2        6      24
1080   19474    31      49    299998.0          3       21       52      11
16520  70617    24      61   5208229.0          2       25       71      38
3323   38117    43      80   3612291.0          1       21       38      21
5706   15196    29      28   1135853.0         11       29       91       9

[4738 rows x 8 columns]

In [216]:
df_sub1['ages'].min()

18

In [217]:
df_sub1['ages'].max()

54

In [218]:
df_sub1['age_cls'] = df_sub1['ages']//10
df_sub1.head()

,ids,ages,orders,purchases,bookmarks,replies,ratings,period,age_cls
6424,6941,33,57,204381.0,5,8,21,4,3
14181,43255,40,5,34325.0,6,25,75,24,4
8550,37222,31,88,6708403.0,3,18,67,20,3
3876,13537,43,32,1975157.0,0,11,15,8,4
12120,69188,34,64,11142283.0,9,11,32,38,3

In [219]:
df_sub1.groupby(['age_cls'])['ids'].count()

age_cls
1     296
2    1573
3    1557
4    1057
5     255
Name: ids, dtype: int64

In [220]:
df_sub1.columns

Index(['ids', 'ages', 'orders', 'purchases', 'bookmarks', 'replies', 'ratings',
       'period', 'age_cls'],
      dtype='object')

In [221]:
col = ['ages', 'orders', 'bookmarks', 'replies', 'ratings',
       'period']
print(col)

['ages', 'orders', 'bookmarks', 'replies', 'ratings', 'period']

In [222]:
scaler = MinMaxScaler().fit(df_sub1[col])

In [223]:
df_sub1[col]=scaler.transform(df_sub1[col])
df_sub1.head()

,ids,ages,orders,purchases,bookmarks,replies,ratings,period,age_cls
6424,6941,0.416667,0.571429,204381.0,0.416667,0.205128,0.100962,0.076923,3
14181,43255,0.611111,0.040816,34325.0,0.500000,0.641026,0.360577,0.589744,4
8550,37222,0.361111,0.887755,6708403.0,0.250000,0.461538,0.322115,0.487179,3
3876,13537,0.694444,0.316327,1975157.0,0.000000,0.282051,0.072115,0.179487,4
12120,69188,0.444444,0.642857,11142283.0,0.750000,0.282051,0.153846,0.948718,3

In [224]:
for k in range(2, 6):
    model = KMeans(k, random_state=random_state).fit(df_sub1[col])
    score = silhouette_score(df_sub1[col], model.labels_, random_state=random_state)
    print(k, score)

2 0.16180321227538863
3 0.14967939166430252
4 0.15079580349497418
5 0.1493027174089563

In [226]:
k = 2
model = KMeans(k, random_state=random_state).fit(df_sub1[col])

In [227]:
df_sub1['label'] = model.labels_
df_sub1.groupby('age_cls')['label'].value_counts(normalize=True)

age_cls  label
1        1        0.520270
         0        0.479730
2        0        0.525111
         1        0.474889
3        0        0.501606
         1        0.498394
4        0        0.510880
         1        0.489120
5        1        0.517647
         0        0.482353
Name: label, dtype: float64

In [230]:
answer = df_sub1.groupby('age_cls')['label'].value_counts(normalize=True).max()
answer = round(answer, 2)
answer

0.53

In [88]:
#Q2

In [89]:
from statsmodels.stats.outliers_influence import variance_inflation_factor

In [231]:
col = ['orders', 'bookmarks', 'replies', 'ratings',
       'period']

In [232]:
for i in range(5):
    vif = variance_inflation_factor(customer[col].values, i)
    print(vif)

3.096205582510852
2.818769218604191
7.534162561524372
5.9332210870176745
3.143516900669937

In [233]:
answer = 'replies'

In [234]:
customer.head()

     ids  ages  orders  purchases  bookmarks  replies  ratings  period
0  47009    42      95  3509917.0          9       14       26      26
1  74838    41      10   673392.0         10       24       72      40
2  34976    20      23  1943940.0          6       20       51      19
3  34959    37      46  1981730.0          0       26       52      19
4  36710    36      93   386907.0         10       30       59      20

In [235]:
df_sub3 = customer.copy()
m = df_sub3['orders'].mean()
df_sub3['regular'] = np.where(df_sub3['orders']>m, 1, 0)
df_sub3

,ids,ages,orders,purchases,bookmarks,replies,ratings,period,regular
0,47009,42,95,3509917.0,9,14,26,26,1
1,74838,41,10,673392.0,10,24,72,40,0
2,34976,20,23,1943940.0,6,20,51,19,0
3,34959,37,46,1981730.0,0,26,52,19,0
4,36710,36,93,386907.0,10,30,59,20,1
...,...,...,...,...,...,...,...,...,...
18946,33105,34,18,1335423.0,11,25,32,18,0
18947,38056,51,60,300000.0,9,32,33,21,1
18948,59148,51,75,4852735.0,0,32,81,32,1
18949,62573,34,63,2372982.0,6,33,71,34,1
18950,24173,21,82,300000.0,7,35,65,14,1

In [236]:
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import train_test_split
from sklearn.metrics import recall_score
random_state=229

In [237]:
train_set, test_set = train_test_split(df_sub3, random_state=random_state, test_size = 0.8)

In [238]:
print(train_set.shape, test_set.shape)

(3790, 9) (15161, 9)

In [239]:
train_set.head()

,ids,ages,orders,purchases,bookmarks,replies,ratings,period,regular
2298,28282,38,29,4348915.0,2,9,29,16,0
10229,45065,22,18,56025.0,12,15,19,24,0
7980,27999,32,83,7882584.0,0,30,30,16,1
12261,33583,23,58,3333148.0,9,23,64,18,1
458,18205,43,51,943312.0,4,2,32,10,1

In [240]:
train_set.columns

Index(['ids', 'ages', 'orders', 'purchases', 'bookmarks', 'replies', 'ratings',
       'period', 'regular'],
      dtype='object')

In [241]:
col = ['ages', 'purchases', 'bookmarks', 'replies', 'ratings',
       'period']

In [242]:
model = GaussianNB()
model.fit(train_set[col], train_set['regular'])

GaussianNB(priors=None, var_smoothing=1e-09)

In [243]:
pred = model.predict(test_set[col])
pred

array([0, 0, 1, ..., 0, 0, 0])

In [244]:
pred = model.predict_proba(test_set[col])[:, 1]
pred

array([0.2261949 , 0.2350681 , 0.99916454, ..., 0.28722555, 0.30003785,
       0.21908346])

In [245]:
thresholds = [0.4, 0.5, 0.6]
for threshold in thresholds:
    score = recall_score(test_set['regular'], pred>threshold)
    print(score)

0.6337730870712401
0.5798153034300791
0.5398416886543536

In [146]:
answer = 0.6